app/controllers/fxkudi_controller.rb

    def generate_card
        #{
        #    "user_id": "1",
        #    "phone" : "22896644879",
        #    "cardholder": "BONIN Koffivi Nutepe"
        #}
        ################################################
        type = Typepaiement.find(TYPE_NEWCARD)
        infotype = Infotype.find(type.info_id)
        l_info_json = JSON.parse(infotype["json"])
        puts l_info_json
        amount_card = l_info_json["prix_fcfa"]["valeur"].to_i

        @pmt = Paiementpaygate.new()
        @pmt.phone = params["phone"]
        @pmt.info_type_pmt_id = type.info_id
        @pmt.type_id = type.id
        #récupérer les infos sur les taux appliqués dans le json du Type DEPOT
        type = Typepaiement.find(TYPE_DEPOT)
        infotype = Infotype.find(type.info_id)

        l_info_json = JSON.parse(infotype["json"])
        @pmt.tx_pg = l_info_json["tx_pg"]["valeur"].to_i
        @pmt.tx_fx = l_info_json["tx_fx"]["valeur"].to_i
        @pmt.tx_ec = l_info_json["tx_ec"]["valeur"].to_i
        @pmt.pmt_done = 0
        @pmt.fxk_done = 0

        @pmt.save()
---
SELECT "typepaiements".* FROM "typepaiements" WHERE "typepaiements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "infotypes".* FROM "infotypes" WHERE "infotypes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "typepaiements".* FROM "typepaiements" WHERE "typepaiements"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "infotypes".* FROM "infotypes" WHERE "infotypes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "paiementpaygates" ("phone", "pmt_done", "fxk_done", "tx_pg", "tx_fx", "tx_ec", "info_type_pmt_id", "created_at", "updated_at", "type_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def fund_card
        #{
        #    "amount" : 500000,
        #    "phone" : "22896644879",
        #    "card_id": "BONIN Koffivi Nutepe"
        #}
        ################################################
        amount = params["amount"]
        #récupérer les infos sur les taux appliqués dans le json du Type DEPOT
        type = Typepaiement.find(TYPE_DEPOT)
        infotype = Infotype.find(type.info_id)

        l_info_json = JSON.parse(infotype["json"])

        @pmt = Paiementpaygate.new()
        @pmt.phone = params["phone"]
        @pmt.info_type_pmt_id = type.info_id
        @pmt.type_id = type.id

        @pmt.tx_pg = l_info_json["tx_pg"]["valeur"].to_i
        @pmt.tx_fx = l_info_json["tx_fx"]["valeur"].to_i
        @pmt.tx_ec = l_info_json["tx_ec"]["valeur"].to_i

        @pmt.pmt_done = 0
        @pmt.fxk_done = 0

        @pmt.save()
---
SELECT "typepaiements".* FROM "typepaiements" WHERE "typepaiements"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "infotypes".* FROM "infotypes" WHERE "infotypes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "paiementpaygates" ("phone", "pmt_done", "fxk_done", "tx_pg", "tx_fx", "tx_ec", "info_type_pmt_id", "created_at", "updated_at", "type_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)