app/controllers/otps_controller.rb

    def envoi_otp
        le_phone = params["phone"]
        le_code = OtpsController::generate_code
        le_text = "Voici votre code de creation de compte\n #{le_code}"

        @otp = Otp.find_by("phone": le_phone)

        if @otp.nil?
            @otp = Otp.new("phone": le_phone, "code": le_code)
        else
            @otp.code = le_code
        end

        if @otp.save
---
SELECT "otps".* FROM "otps" WHERE "otps"."phone" = ? LIMIT ?  [["phone", "22896644879"], ["LIMIT", 1]]
UPDATE "otps" SET "code" = ?, "updated_at" = ? WHERE "otps"."id" = ?  [["code", 247870], ["updated_at", "2021-06-16 13:31:05.425185"], ["id", 1]]
INSERT INTO "otps" ("phone", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["phone", "22896644879"], ["code", 450470], ["created_at", "2021-06-24 11:24:08.117169"], ["updated_at", "2021-06-24 11:24:08.117169"]]

    def verify_otp
        @otp = Otp.where(phone: params["phone"])
                .where(code: params["code"])
                .where(["updated_at >= ?", DateTime.now - TIMEOUT])
                .where(["updated_at <= ?", DateTime.now]).first
---
SELECT "otps".* FROM "otps" WHERE "otps"."phone" = ? AND "otps"."code" = ? AND (updated_at >= '2021-06-16 14:29:21.515601') AND (updated_at <= '2021-06-16 14:32:21.528834') ORDER BY "otps"."id" ASC LIMIT ?  [["phone", "93708315"], ["code", 111111], ["LIMIT", 1]]