app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."phone" = ? LIMIT ?  [["phone", "22891367306"], ["LIMIT", 1]]
---
    def verify_credentials
        #{
        #    "phone": "22891367306",
        #    "password_digest": "togovabien"
        #}

        @user = User.find_by(phone: params["phone"])

SELECT "users".* FROM "users" WHERE "users"."phone" = ? LIMIT ?  [["phone", "93708315"], ["LIMIT", 1]]
INSERT INTO "users" ("phone", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["phone", "93708315"], ["password_digest", "togovabien"], ["created_at", "2021-06-16 13:51:04.397059"], ["updated_at", "2021-06-16 13:51:04.397059"]]
---
    def create
        @user = User.find_by("phone": params["phone"])

        if @user.nil?
            @user = User.new("phone": params["phone"], "password_digest": params["password_digest"])
        else
            render json: {"status": 0, "message": "Le compte existe déja"}
            return
        end

        if @user.save